nichengyan/Cadio_V2.0Pro/Cadio_V2_Final/卡东欧录音/comm/_STC8X_.h
/*---------------------------------------------------------------------*/
/* --- STC MCU Limited ------------------------------------------------*/
/* --- STC 1T Series MCU Demo Programme -------------------------------*/
/* --- Mobile: (86)13922805190 ----------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ------------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ------------------------*/
/* --- Web: www.STCMCU.com --------------------------------------------*/
/* --- Web: www.STCMCUDATA.com  ---------------------------------------*/
/* --- QQ:  800003751 -------------------------------------------------*/
/* 如果要在程序中使用此代码,请在程序中注明使用了STC的资料及程序        */
/*---------------------------------------------------------------------*/

#ifndef	_STC8X_H
#define	_STC8X_H

#include <intrins.h>

/*  BYTE Registers  */
sfr P0    = 0x80;
sfr SP    = 0x81;
sfr DPL   = 0x82;
sfr DPH   = 0x83;
sfr	S4CON = 0x84;
sfr	S4BUF = 0x85;
sfr PCON  = 0x87;

sfr TCON = 0x88;
sfr TMOD = 0x89;
sfr TL0  = 0x8A;
sfr TL1  = 0x8B;
sfr TH0  = 0x8C;
sfr TH1  = 0x8D;
sfr	AUXR = 0x8E;
sfr INT_CLKO = 0x8F;
sfr INTCLKO  = 0x8F;

sfr P1    = 0x90;
sfr P1M1  = 0x91;	//P1M1.n,P1M0.n 	=00--->Standard,	01--->push-pull		实际上1T的都一样
sfr P1M0  = 0x92;	//					=10--->pure input,	11--->open drain
sfr P0M1  = 0x93;	//P0M1.n,P0M0.n 	=00--->Standard,	01--->push-pull
sfr P0M0  = 0x94;	//					=10--->pure input,	11--->open drain
sfr P2M1  = 0x95;	//P2M1.n,P2M0.n 	=00--->Standard,	01--->push-pull
sfr P2M0  = 0x96;	//					=10--->pure input,	11--->open drain

sfr SCON  = 0x98;
sfr SBUF  = 0x99;
sfr S2CON = 0x9A;	//
sfr S2BUF = 0x9B;	//
sfr IRCBAND = 0x9D;	//IRC频段选择检测
sfr LIRTRIM = 0x9E;	//IRC频率微调寄存器
sfr IRTRIM  = 0x9F;	//IRC频率调整寄存器

sfr P2    = 0xA0;
sfr P_SW1 = 0xA2;	//外设端口切换寄存器1

sfr IE    = 0xA8;
sfr SADDR = 0xA9;
sfr WKTCL = 0xAA;	//唤醒定时器低字节
sfr WKTCH = 0xAB;	//唤醒定时器高字节
sfr	S3CON = 0xAC;
sfr S3BUF = 0xAD;
sfr TA    = 0xAE;	//DPTR时序控制寄存器
sfr IE2   = 0xAF;	//中断允许寄存器2

sfr P3    = 0xB0;
sfr P3M1  = 0xB1;	//P3M1.n,P3M0.n 	=00--->Standard,	01--->push-pull
sfr P3M0  = 0xB2;	//					=10--->pure input,	11--->open drain
sfr P4M1  = 0xB3;	//P4M1.n,P4M0.n 	=00--->Standard,	01--->push-pull
sfr P4M0  = 0xB4;	//					=10--->pure input,	11--->open drain
sfr IP2   = 0xB5;	//
sfr IP2H  = 0xB6;	//
sfr IPH   = 0xB7;

sfr IP        = 0xB8;
sfr SADEN     = 0xB9;
sfr	P_SW2     = 0xBA;	//外设端口切换寄存器2
sfr ADC_CONTR = 0xBC;	//ADC控制寄存器
sfr ADC_RES   = 0xBD;	//ADC结果高字节
sfr ADC_RESL  = 0xBE;	//ADC结果低字节

sfr P4        = 0xC0;
sfr WDT_CONTR = 0xC1;
sfr IAP_DATA  = 0xC2;
sfr IAP_ADDRH = 0xC3;
sfr IAP_ADDRL = 0xC4;
sfr IAP_CMD   = 0xC5;
sfr IAP_TRIG  = 0xC6;
sfr IAP_CONTR = 0xC7;

sfr ISP_DATA  = 0xC2;
sfr ISP_ADDRH = 0xC3;
sfr ISP_ADDRL = 0xC4;
sfr ISP_CMD   = 0xC5;
sfr ISP_TRIG  = 0xC6;
sfr ISP_CONTR = 0xC7;

sfr P5     = 0xC8;	//
sfr P5M1   = 0xC9;	//	P5M1.n,P5M0.n 	=00--->Standard,	01--->push-pull
sfr P5M0   = 0xCA;	//					=10--->pure input,	11--->open drain
sfr P6M1   = 0xCB;	//	P6M1.n,P6M0.n 	=00--->Standard,	01--->push-pull
sfr P6M0   = 0xCC;	//					=10--->pure input,	11--->open drain
sfr SPSTAT = 0xCD;	//SPI状态寄存器
sfr SPCTL  = 0xCE;	//SPI控制寄存器
sfr SPDAT  = 0xCF;	//SPI数据寄存器

sfr PSW    = 0xD0;
sfr	T4T3M  = 0xD1;
sfr	T4H    = 0xD2;
sfr	T4L    = 0xD3;
sfr	T3H    = 0xD4;
sfr	T3L    = 0xD5;
sfr	T2H    = 0xD6;
sfr	T2L    = 0xD7;

sfr	TH4    = 0xD2;
sfr	TL4    = 0xD3;
sfr	TH3    = 0xD4;
sfr	TL3    = 0xD5;
sfr	TH2    = 0xD6;
sfr	TL2    = 0xD7;

sfr USBCLK = 0xDC;	//USB时钟控制寄存器。
sfr	ADCCFG = 0xDE;	//ADC配置寄存器
sfr	IP3    = 0xDF;	//中断优先级控制寄存器3

sfr ACC    = 0xE0;
sfr	P7M1   = 0xE1;	//	P7M1.n,P7M0.n 	=00--->Standard,	01--->push-pull
sfr	P7M0   = 0xE2;	//					=10--->pure input,	11--->open drain
sfr	DPS    = 0xE3;	//DPTR指针选择寄存器
sfr	DPL1   = 0xE4;	//第2组数据指针低字节
sfr	DPH1   = 0xE5;	//第2组数据指针高字节
sfr	CMPCR1 = 0xE6;	//比较器控制寄存器1
sfr	CMPCR2 = 0xE7;	//比较器控制寄存器2

sfr	P6     = 0xE8;
sfr USBDAT = 0xEC;	//USB数据寄存器
sfr	IP3H   = 0xEE;	//高中断优先级控制寄存器3
sfr	AUXINTIF = 0xEF;	//扩展外部中断标志寄存器 B6-INT4IF, B5-INT3IF, B4-INT2IF, B2-T4IF, B1-T3IF, B0-T2IF

sfr B        = 0xF0;
sfr USBCON   = 0xF4;	//USB控制寄存器。
sfr	IAP_TPS  = 0xf5;	//IAP等待时间控制寄存器

sfr	P7       = 0xF8;
sfr USBADR   = 0xFC;	//USB地址寄存器
sfr	RSTCFG   = 0xFF;		//复位配置寄存器

//=============================================================================================================
#define COMEN     (*(unsigned char volatile xdata *)0xfb00)	/* COM使能寄存器 */
#define SEGENL    (*(unsigned char volatile xdata *)0xfb01)	/* SEG使能寄存器 */
#define SEGENH    (*(unsigned char volatile xdata *)0xfb02)	/* SEG使能寄存器 */
#define LEDCTRL   (*(unsigned char volatile xdata *)0xfb03)	/* LED控制寄存器 */
#define LEDCKS    (*(unsigned char volatile xdata *)0xfb04)	/* LED时钟分频寄存器 */

#define COM0_DAL  (*(unsigned char volatile xdata *)0xfb10)	/* 共阳模式显示数据 */
#define COM1_DAL  (*(unsigned char volatile xdata *)0xfb11)	/* 共阳模式显示数据 */
#define COM2_DAL  (*(unsigned char volatile xdata *)0xfb12)	/* 共阳模式显示数据 */
#define COM3_DAL  (*(unsigned char volatile xdata *)0xfb13)	/* 共阳模式显示数据 */
#define COM4_DAL  (*(unsigned char volatile xdata *)0xfb14)	/* 共阳模式显示数据 */
#define COM5_DAL  (*(unsigned char volatile xdata *)0xfb15)	/* 共阳模式显示数据 */
#define COM6_DAL  (*(unsigned char volatile xdata *)0xfb16)	/* 共阳模式显示数据 */
#define COM7_DAL  (*(unsigned char volatile xdata *)0xfb17)	/* 共阳模式显示数据 */
#define COM0_DAH  (*(unsigned char volatile xdata *)0xfb18)	/* 共阳模式显示数据 */
#define COM1_DAH  (*(unsigned char volatile xdata *)0xfb19)	/* 共阳模式显示数据 */
#define COM2_DAH  (*(unsigned char volatile xdata *)0xfb1a)	/* 共阳模式显示数据 */
#define COM3_DAH  (*(unsigned char volatile xdata *)0xfb1b)	/* 共阳模式显示数据 */
#define COM4_DAH  (*(unsigned char volatile xdata *)0xfb1c)	/* 共阳模式显示数据 */
#define COM5_DAH  (*(unsigned char volatile xdata *)0xfb1d)	/* 共阳模式显示数据 */
#define COM6_DAH  (*(unsigned char volatile xdata *)0xfb1e)	/* 共阳模式显示数据 */
#define COM7_DAH  (*(unsigned char volatile xdata *)0xfb1f)	/* 共阳模式显示数据 */

#define COM0_DCL  (*(unsigned char volatile xdata *)0xfb20)	/* 共阴模式显示数据 */
#define COM1_DCL  (*(unsigned char volatile xdata *)0xfb21)	/* 共阴模式显示数据 */
#define COM2_DCL  (*(unsigned char volatile xdata *)0xfb22)	/* 共阴模式显示数据 */
#define COM3_DCL  (*(unsigned char volatile xdata *)0xfb23)	/* 共阴模式显示数据 */
#define COM4_DCL  (*(unsigned char volatile xdata *)0xfb24)	/* 共阴模式显示数据 */
#define COM5_DCL  (*(unsigned char volatile xdata *)0xfb25)	/* 共阴模式显示数据 */
#define COM6_DCL  (*(unsigned char volatile xdata *)0xfb26)	/* 共阴模式显示数据 */
#define COM7_DCL  (*(unsigned char volatile xdata *)0xfb27)	/* 共阴模式显示数据 */
#define COM0_DCH  (*(unsigned char volatile xdata *)0xfb28)	/* 共阴模式显示数据 */
#define COM1_DCH  (*(unsigned char volatile xdata *)0xfb29)	/* 共阴模式显示数据 */
#define COM2_DCH  (*(unsigned char volatile xdata *)0xfb2a)	/* 共阴模式显示数据 */
#define COM3_DCH  (*(unsigned char volatile xdata *)0xfb2b)	/* 共阴模式显示数据 */
#define COM4_DCH  (*(unsigned char volatile xdata *)0xfb2c)	/* 共阴模式显示数据 */
#define COM5_DCH  (*(unsigned char volatile xdata *)0xfb2d)	/* 共阴模式显示数据 */
#define COM6_DCH  (*(unsigned char volatile xdata *)0xfb2e)	/* 共阴模式显示数据 */
#define COM7_DCH  (*(unsigned char volatile xdata *)0xfb2f)	/* 共阴模式显示数据 */

#define TSCHEN     (*(unsigned int  volatile xdata *)0xfb40)	/* 触摸按键使能寄存器 */
#define TSCFG      (*(unsigned int  volatile xdata *)0xfb42)	/* 触摸按键配置寄存器1 */
#define TSSTA      (*(unsigned int  volatile xdata *)0xfb46)	/* 触摸按键状态寄存器1 */
#define TSDAT      (*(unsigned int  volatile xdata *)0xfb49)	/* 触摸按键数据 */
#define TSTH00     (*(unsigned int  volatile xdata *)0xfb50)	/* 触摸按键0门槛值高字节 */
#define TSTH01     (*(unsigned int  volatile xdata *)0xfb52)	/* 触摸按键1门槛值高字节 */
#define TSTH02     (*(unsigned int  volatile xdata *)0xfb54)	/* 触摸按键2门槛值高字节 */
#define TSTH03     (*(unsigned int  volatile xdata *)0xfb56)	/* 触摸按键3门槛值高字节 */
#define TSTH04     (*(unsigned int  volatile xdata *)0xfb58)	/* 触摸按键4门槛值高字节 */
#define TSTH05     (*(unsigned int  volatile xdata *)0xfb5a)	/* 触摸按键5门槛值高字节 */
#define TSTH06     (*(unsigned int  volatile xdata *)0xfb5c)	/* 触摸按键6门槛值高字节 */
#define TSTH07     (*(unsigned int  volatile xdata *)0xfb5e)	/* 触摸按键7门槛值高字节 */
#define TSTH08     (*(unsigned int  volatile xdata *)0xfb60)	/* 触摸按键8门槛值高字节 */
#define TSTH09     (*(unsigned int  volatile xdata *)0xfb62)	/* 触摸按键9门槛值高字节 */
#define TSTH10     (*(unsigned int  volatile xdata *)0xfb64)	/* 触摸按键10门槛值高字节 */
#define TSTH11     (*(unsigned int  volatile xdata *)0xfb66)	/* 触摸按键11门槛值高字节 */
#define TSTH12     (*(unsigned int  volatile xdata *)0xfb68)	/* 触摸按键12门槛值高字节 */
#define TSTH13     (*(unsigned int  volatile xdata *)0xfb6a)	/* 触摸按键13门槛值高字节 */
#define TSTH14     (*(unsigned int  volatile xdata *)0xfb6c)	/* 触摸按键14门槛值高字节 */
#define TSTH15     (*(unsigned int  volatile xdata *)0xfb6e)	/* 触摸按键15门槛值高字节 */

#define TSCHEN1    (*(unsigned char volatile xdata *)0xfb40)	/* 触摸按键使能寄存器1 */
#define TSCHEN2    (*(unsigned char volatile xdata *)0xfb41)	/* 触摸按键使能寄存器2 */
#define TSCFG1     (*(unsigned char volatile xdata *)0xfb42)	/* 触摸按键配置寄存器1 */
#define TSCFG2     (*(unsigned char volatile xdata *)0xfb43)	/* 触摸按键配置寄存器2 */
#define TSWUTC     (*(unsigned char volatile xdata *)0xfb44)	/* 触摸按键唤醒控制寄存器 */
#define TSCTRL     (*(unsigned char volatile xdata *)0xfb45)	/* 触摸按键控制寄存器  */
#define TSSTA1     (*(unsigned char volatile xdata *)0xfb46)	/* 触摸按键状态寄存器1 */
#define TSSTA2     (*(unsigned char volatile xdata *)0xfb47)	/* 触摸按键状态寄存器2 */

#define TSRT       (*(unsigned char volatile xdata *)0xfb48)	/* 触摸按键时间控制寄存器 */
#define TSDATH     (*(unsigned char volatile xdata *)0xfb49)	/* 触摸按键数据高字节 */
#define TSDATL     (*(unsigned char volatile xdata *)0xfb4a)	/* 触摸按键数据低字节 */

#define TSTH00H    (*(unsigned char volatile xdata *)0xfb50)	/* 触摸按键0门槛值高字节 */
#define TSTH00L    (*(unsigned char volatile xdata *)0xfb51)	/* 触摸按键0门槛值低字节 */
#define TSTH01H    (*(unsigned char volatile xdata *)0xfb52)	/* 触摸按键1门槛值高字节 */
#define TSTH01L    (*(unsigned char volatile xdata *)0xfb53)	/* 触摸按键1门槛值低字节 */
#define TSTH02H    (*(unsigned char volatile xdata *)0xfb54)	/* 触摸按键2门槛值高字节 */
#define TSTH02L    (*(unsigned char volatile xdata *)0xfb55)	/* 触摸按键2门槛值低字节 */
#define TSTH03H    (*(unsigned char volatile xdata *)0xfb56)	/* 触摸按键3门槛值高字节 */
#define TSTH03L    (*(unsigned char volatile xdata *)0xfb57)	/* 触摸按键3门槛值低字节 */
#define TSTH04H    (*(unsigned char volatile xdata *)0xfb58)	/* 触摸按键4门槛值高字节 */
#define TSTH04L    (*(unsigned char volatile xdata *)0xfb59)	/* 触摸按键4门槛值低字节 */
#define TSTH05H    (*(unsigned char volatile xdata *)0xfb5a)	/* 触摸按键5门槛值高字节 */
#define TSTH05L    (*(unsigned char volatile xdata *)0xfb5b)	/* 触摸按键5门槛值低字节 */
#define TSTH06H    (*(unsigned char volatile xdata *)0xfb5c)	/* 触摸按键6门槛值高字节 */
#define TSTH06L    (*(unsigned char volatile xdata *)0xfb5d)	/* 触摸按键6门槛值低字节 */
#define TSTH07H    (*(unsigned char volatile xdata *)0xfb5e)	/* 触摸按键7门槛值高字节 */
#define TSTH07L    (*(unsigned char volatile xdata *)0xfb5f)	/* 触摸按键7门槛值低字节 */
#define TSTH08H    (*(unsigned char volatile xdata *)0xfb60)	/* 触摸按键8门槛值高字节 */
#define TSTH08L    (*(unsigned char volatile xdata *)0xfb61)	/* 触摸按键8门槛值低字节 */
#define TSTH09H    (*(unsigned char volatile xdata *)0xfb62)	/* 触摸按键9门槛值高字节 */
#define TSTH09L    (*(unsigned char volatile xdata *)0xfb63)	/* 触摸按键9门槛值低字节 */
#define TSTH10H    (*(unsigned char volatile xdata *)0xfb64)	/* 触摸按键10门槛值高字节 */
#define TSTH10L    (*(unsigned char volatile xdata *)0xfb65)	/* 触摸按键10门槛值低字节 */
#define TSTH11H    (*(unsigned char volatile xdata *)0xfb66)	/* 触摸按键11门槛值高字节 */
#define TSTH11L    (*(unsigned char volatile xdata *)0xfb67)	/* 触摸按键11门槛值低字节 */
#define TSTH12H    (*(unsigned char volatile xdata *)0xfb68)	/* 触摸按键12门槛值高字节 */
#define TSTH12L    (*(unsigned char volatile xdata *)0xfb69)	/* 触摸按键12门槛值低字节 */
#define TSTH13H    (*(unsigned char volatile xdata *)0xfb6a)	/* 触摸按键13门槛值高字节 */
#define TSTH13L    (*(unsigned char volatile xdata *)0xfb6b)	/* 触摸按键13门槛值低字节 */
#define TSTH14H    (*(unsigned char volatile xdata *)0xfb6c)	/* 触摸按键14门槛值高字节 */
#define TSTH14L    (*(unsigned char volatile xdata *)0xfb6d)	/* 触摸按键14门槛值低字节 */
#define TSTH15H    (*(unsigned char volatile xdata *)0xfb6e)	/* 触摸按键15门槛值高字节 */
#define TSTH15L    (*(unsigned char volatile xdata *)0xfb6f)	/* 触摸按键15门槛值低字节 */


