nichengyan/Cadio_V2.0Pro/Cadio_V2_Final/卡东欧录音/comm/_STC8X_.h
#define MD3U32    (*(unsigned long volatile xdata *)0xfcf0)	/* MDU数据寄存器 */
#define MD3U16    (*(unsigned int  volatile xdata *)0xfcf0)	/* MDU数据寄存器 */
#define MD1U16    (*(unsigned int  volatile xdata *)0xfcf2)	/* MDU数据寄存器 */
#define MD5U16    (*(unsigned int  volatile xdata *)0xfcf4)	/* MDU数据寄存器 */

#define MD3       (*(unsigned char volatile xdata *)0xfcf0)	/* MDU数据寄存器 */
#define MD2       (*(unsigned char volatile xdata *)0xfcf1)	/* MDU数据寄存器 */
#define MD1       (*(unsigned char volatile xdata *)0xfcf2)	/* MDU数据寄存器 */
#define MD0       (*(unsigned char volatile xdata *)0xfcf3)	/* MDU数据寄存器 */
#define MD5       (*(unsigned char volatile xdata *)0xfcf4)	/* MDU数据寄存器 */
#define MD4       (*(unsigned char volatile xdata *)0xfcf5)	/* MDU数据寄存器 */
#define ARCON     (*(unsigned char volatile xdata *)0xfcf6)	/* MDU模式控制寄存器 */
#define OPCON     (*(unsigned char volatile xdata *)0xfcf7)	/* MDU操作控制寄存器 */

#define P0INTE      (*(unsigned char volatile xdata *)0xfd00)	/* P0口中断使能寄存器 */
#define P1INTE      (*(unsigned char volatile xdata *)0xfd01)	/* P1口中断使能寄存器 */
#define P2INTE      (*(unsigned char volatile xdata *)0xfd02)	/* P2口中断使能寄存器 */
#define P3INTE      (*(unsigned char volatile xdata *)0xfd03)	/* P3口中断使能寄存器 */
#define P4INTE      (*(unsigned char volatile xdata *)0xfd04)	/* P4口中断使能寄存器 */
#define P5INTE      (*(unsigned char volatile xdata *)0xfd05)	/* P5口中断使能寄存器 */
#define P6INTE      (*(unsigned char volatile xdata *)0xfd06)	/* P6口中断使能寄存器 */
#define P7INTE      (*(unsigned char volatile xdata *)0xfd07)	/* P7口中断使能寄存器 */

#define P0INTF      (*(unsigned char volatile xdata *)0xfd10)	/* P0口中断标志寄存器 */
#define P1INTF      (*(unsigned char volatile xdata *)0xfd11)	/* P1口中断标志寄存器 */
#define P2INTF      (*(unsigned char volatile xdata *)0xfd12)	/* P2口中断标志寄存器 */
#define P3INTF      (*(unsigned char volatile xdata *)0xfd13)	/* P3口中断标志寄存器 */
#define P4INTF      (*(unsigned char volatile xdata *)0xfd14)	/* P4口中断标志寄存器 */
#define P5INTF      (*(unsigned char volatile xdata *)0xfd15)	/* P5口中断标志寄存器 */
#define P6INTF      (*(unsigned char volatile xdata *)0xfd16)	/* P6口中断标志寄存器 */
#define P7INTF      (*(unsigned char volatile xdata *)0xfd17)	/* P7口中断标志寄存器 */

#define P0IM0       (*(unsigned char volatile xdata *)0xfd20)	/* P0口中断模式寄存器0 */
#define P1IM0       (*(unsigned char volatile xdata *)0xfd21)	/* P1口中断模式寄存器0 */
#define P2IM0       (*(unsigned char volatile xdata *)0xfd22)	/* P2口中断模式寄存器0 */
#define P3IM0       (*(unsigned char volatile xdata *)0xfd23)	/* P3口中断模式寄存器0 */
#define P4IM0       (*(unsigned char volatile xdata *)0xfd24)	/* P4口中断模式寄存器0 */
#define P5IM0       (*(unsigned char volatile xdata *)0xfd25)	/* P5口中断模式寄存器0 */
#define P6IM0       (*(unsigned char volatile xdata *)0xfd26)	/* P6口中断模式寄存器0 */
#define P7IM0       (*(unsigned char volatile xdata *)0xfd27)	/* P7口中断模式寄存器0 */

#define P0IM1       (*(unsigned char volatile xdata *)0xfd30)	/* P0口中断模式寄存器1 */
#define P1IM1       (*(unsigned char volatile xdata *)0xfd31)	/* P1口中断模式寄存器1 */
#define P2IM1       (*(unsigned char volatile xdata *)0xfd32)	/* P2口中断模式寄存器1 */
#define P3IM1       (*(unsigned char volatile xdata *)0xfd33)	/* P3口中断模式寄存器1 */
#define P4IM1       (*(unsigned char volatile xdata *)0xfd34)	/* P4口中断模式寄存器1 */
#define P5IM1       (*(unsigned char volatile xdata *)0xfd35)	/* P5口中断模式寄存器1 */
#define P6IM1       (*(unsigned char volatile xdata *)0xfd36)	/* P6口中断模式寄存器1 */
#define P7IM1       (*(unsigned char volatile xdata *)0xfd37)	/* P7口中断模式寄存器1 */

#define INTE_0       0x01	/* 使能Px.0口中断功能 */
#define INTE_1       0x02	/* 使能Px.1口中断功能 */
#define INTE_2       0x04	/* 使能Px.2口中断功能 */
#define INTE_3       0x08	/* 使能Px.3口中断功能 */
#define INTE_4       0x10	/* 使能Px.4口中断功能 */
#define INTE_5       0x20	/* 使能Px.5口中断功能 */
#define INTE_6       0x40	/* 使能Px.6口中断功能 */
#define INTE_7       0x80	/* 使能Px.7口中断功能 */

#define INTF_0       0x01	/* 使能Px.0口中断标志 */
#define INTF_1       0x02	/* 使能Px.1口中断标志 */
#define INTF_2       0x04	/* 使能Px.2口中断标志 */
#define INTF_3       0x08	/* 使能Px.3口中断标志 */
#define INTF_4       0x10	/* 使能Px.4口中断标志 */
#define INTF_5       0x20	/* 使能Px.5口中断标志 */
#define INTF_6       0x40	/* 使能Px.6口中断标志 */
#define INTF_7       0x80	/* 使能Px.7口中断标志 */

#define	INT_FALL	0		/* 下降沿中断   */
#define	INT_RISE	1		/* 上升沿中断   */
#define	INT_LOW		2		/* 低电平中断   */
#define	INT_HIGH	3		/* 高电平中断   */

#define CLKSEL      (*(unsigned char volatile xdata *)0xfe00)
#define	CKSEL		(*(unsigned char volatile xdata *)0xfe00)	/* 主时钟源选择    */
#define	CLKDIV		(*(unsigned char volatile xdata *)0xfe01)	/* 主时钟分频      */
#define	CKDIV		(*(unsigned char volatile xdata *)0xfe01)	/* 主时钟分频      */
//#define	IRC24MCR	(*(unsigned char volatile xdata *)0xfe02)	/* IRC 24MHZ控制   */
#define	HIRCCR		(*(unsigned char volatile xdata *)0xfe02)	/* 内部高速振荡器控制寄存器 */
#define	XOSCCR		(*(unsigned char volatile xdata *)0xfe03)	/* XOSC控制        */
#define	IRC32KCR	(*(unsigned char volatile xdata *)0xfe04)	/* IRC 32KHZ控制   */
#define	MCLKOCR		(*(unsigned char volatile xdata *)0xfe05)	/* 主时钟输出控制寄存器  */
#define	IRCDB		(*(unsigned char volatile xdata *)0xfe06)	/* 内部高速振荡器去抖控制寄存器   */
#define	IRC48MCR	(*(unsigned char volatile xdata *)0xfe07)	/* 内部48M振荡器控制寄存器  */
#define	SPFUNC		(*(unsigned char volatile xdata *)0xfe08)	/* 特殊功能控制寄存器   */
#define	RSTFLAG		(*(unsigned char volatile xdata *)0xfe09)	/* 复位标志寄存器  */

#define	P0PU		(*(unsigned char volatile xdata *)0xfe10)	/* P0口内部3.7K上拉电阻, 0: 禁止(默认), 1: 允许  */
#define	P1PU		(*(unsigned char volatile xdata *)0xfe11)	/* P1口内部3.7K上拉电阻  */
#define	P2PU		(*(unsigned char volatile xdata *)0xfe12)	/* P2口内部3.7K上拉电阻  */
#define	P3PU		(*(unsigned char volatile xdata *)0xfe13)	/* P3口内部3.7K上拉电阻  */
#define	P4PU		(*(unsigned char volatile xdata *)0xfe14)	/* P4口内部3.7K上拉电阻  */
#define	P5PU		(*(unsigned char volatile xdata *)0xfe15)	/* P5口内部3.7K上拉电阻  */
#define	P6PU		(*(unsigned char volatile xdata *)0xfe16)	/* P6口内部3.7K上拉电阻  */
#define	P7PU		(*(unsigned char volatile xdata *)0xfe17)	/* P7口内部3.7K上拉电阻  */

#define	P0NCS		(*(unsigned char volatile xdata *)0xfe18)	/* P0 Non Schmit Trigger  0: 使能端口施密特触发功能(默认), 1: 禁止  */
#define	P1NCS		(*(unsigned char volatile xdata *)0xfe19)	/* P1 Non Schmit Trigger  */
#define	P2NCS		(*(unsigned char volatile xdata *)0xfe1a)	/* P2 Non Schmit Trigger  */
#define	P3NCS		(*(unsigned char volatile xdata *)0xfe1b)	/* P3 Non Schmit Trigger  */
#define	P4NCS		(*(unsigned char volatile xdata *)0xfe1c)	/* P4 Non Schmit Trigger  */
#define	P5NCS		(*(unsigned char volatile xdata *)0xfe1d)	/* P5 Non Schmit Trigger  */
#define	P6NCS		(*(unsigned char volatile xdata *)0xfe1e)	/* P6 Non Schmit Trigger  */
#define	P7NCS		(*(unsigned char volatile xdata *)0xfe1f)	/* P7 Non Schmit Trigger  */

#define	P0SR		(*(unsigned char volatile xdata *)0xfe20)	/* P0口电平转换速率寄存器 默认1: 普通模式, 0:高速模式 */
#define	P1SR		(*(unsigned char volatile xdata *)0xfe21)	/* P1口电平转换速率寄存器  */
#define	P2SR		(*(unsigned char volatile xdata *)0xfe22)	/* P2口电平转换速率寄存器  */
#define	P3SR		(*(unsigned char volatile xdata *)0xfe23)	/* P3口电平转换速率寄存器  */
#define	P4SR		(*(unsigned char volatile xdata *)0xfe24)	/* P4口电平转换速率寄存器  */
#define	P5SR		(*(unsigned char volatile xdata *)0xfe25)	/* P5口电平转换速率寄存器  */
#define	P6SR		(*(unsigned char volatile xdata *)0xfe26)	/* P6口电平转换速率寄存器  */
#define	P7SR		(*(unsigned char volatile xdata *)0xfe27)	/* P7口电平转换速率寄存器  */

#define	P0DR		(*(unsigned char volatile xdata *)0xfe28)	/* P0口驱动电流控制寄存器 默认1: 普通模式, 0:大电流模式*/
#define	P1DR		(*(unsigned char volatile xdata *)0xfe29)	/* P1口驱动电流控制寄存器 */
#define	P2DR		(*(unsigned char volatile xdata *)0xfe2a)	/* P2口驱动电流控制寄存器 */
#define	P3DR		(*(unsigned char volatile xdata *)0xfe2b)	/* P3口驱动电流控制寄存器 */
#define	P4DR		(*(unsigned char volatile xdata *)0xfe2c)	/* P4口驱动电流控制寄存器 */
#define	P5DR		(*(unsigned char volatile xdata *)0xfe2d)	/* P5口驱动电流控制寄存器 */
#define	P6DR		(*(unsigned char volatile xdata *)0xfe2e)	/* P6口驱动电流控制寄存器 */
#define	P7DR		(*(unsigned char volatile xdata *)0xfe2f)	/* P7口驱动电流控制寄存器 */

#define	P0IE		(*(unsigned char volatile xdata *)0xfe30)	/* P0口输入使能控制寄存器 */
#define	P1IE		(*(unsigned char volatile xdata *)0xfe31)	/* P1口输入使能控制寄存器 */
#define	P3IE		(*(unsigned char volatile xdata *)0xfe33)	/* P3口输入使能控制寄存器 */

#define	RTCCR		(*(unsigned char volatile xdata *)0xfe60)	/* RTC控制寄存器 */
#define	RTCCFG		(*(unsigned char volatile xdata *)0xfe61)	/* RTC配置寄存器 */
#define	RTCIEN		(*(unsigned char volatile xdata *)0xfe62)	/* RTC中断使能寄存器 */
#define	RTCIF		(*(unsigned char volatile xdata *)0xfe63)	/* RTC中断请求寄存器 */
#define	ALAHOUR		(*(unsigned char volatile xdata *)0xfe64)	/* RTC闹钟的小时值 */
#define	ALAMIN		(*(unsigned char volatile xdata *)0xfe65)	/* RTC闹钟的分钟值 */
#define	ALASEC		(*(unsigned char volatile xdata *)0xfe66)	/* RTC闹钟的秒值 */
#define	ALASSEC		(*(unsigned char volatile xdata *)0xfe67)	/* RTC闹钟的1/128秒值 */
#define	INIYEAR		(*(unsigned char volatile xdata *)0xfe68)	/* RTC年初始化 */
#define	INIMONTH	(*(unsigned char volatile xdata *)0xfe69)	/* RTC月初始化 */
#define	INIDAY		(*(unsigned char volatile xdata *)0xfe6a)	/* RTC日初始化 */
#define	INIHOUR		(*(unsigned char volatile xdata *)0xfe6b)	/* RTC时初始化 */
#define	INIMIN		(*(unsigned char volatile xdata *)0xfe6c)	/* RTC分初始化 */
#define	INISEC		(*(unsigned char volatile xdata *)0xfe6d)	/* RTC秒初始化 */
#define	INISSEC		(*(unsigned char volatile xdata *)0xfe6e)	/* RTC1/128秒初始化 */
#define	YEAR		(*(unsigned char volatile xdata *)0xfe70)	/* RTC的年计数值 */
#define	MONTH		(*(unsigned char volatile xdata *)0xfe71)	/* RTC的月计数值 */
#define	DAY			(*(unsigned char volatile xdata *)0xfe72)	/* RTC的日计数值 */
#define	HOUR		(*(unsigned char volatile xdata *)0xfe73)	/* RTC的时计数值 */
#define	MIN			(*(unsigned char volatile xdata *)0xfe74)	/* RTC的分计数值 */
#define	SEC			(*(unsigned char volatile xdata *)0xfe75)	/* RTC的秒计数值 */
#define	SSEC		(*(unsigned char volatile xdata *)0xfe76)	/* RTC的1/128秒计数值 */

#define	I2CCFG		(*(unsigned char volatile xdata *)0xfe80)	/* I2C配置寄存器  */
#define	I2CMSCR		(*(unsigned char volatile xdata *)0xfe81)	/* I2C主机控制寄存器  */
#define	I2CMSST		(*(unsigned char volatile xdata *)0xfe82)	/* I2C主机状态寄存器  */
#define	I2CSLCR		(*(unsigned char volatile xdata *)0xfe83)	/* I2C从机控制寄存器  */
#define	I2CSLST		(*(unsigned char volatile xdata *)0xfe84)	/* I2C从机状态寄存器  */
#define	I2CSLADR	(*(unsigned char volatile xdata *)0xfe85)	/* I2C从机地址寄存器  */
#define	I2CTXD		(*(unsigned char volatile xdata *)0xfe86)	/* I2C数据发送寄存器  */
#define	I2CRXD		(*(unsigned char volatile xdata *)0xfe87)	/* I2C数据接收寄存器  */
#define	I2CMSAUX	(*(unsigned char volatile xdata *)0xfe88)	/* I2C主机辅助控制寄存器  */

#define	TM2PS		(*(unsigned char volatile xdata *)0xfea2)	/* 定时器2时钟预分频寄存器  */
#define	TM3PS		(*(unsigned char volatile xdata *)0xfea3)	/* 定时器3时钟预分频寄存器  */
#define	TM4PS		(*(unsigned char volatile xdata *)0xfea4)	/* 定时器4时钟预分频寄存器  */
#define	ADCTIM		(*(unsigned char volatile xdata *)0xfea8)	/* ADC时序控制寄存器  */
#define	T3T4PIN		(*(unsigned char volatile xdata *)0xfeac)	/* T3/T4选择寄存器  */

#define	PWMA_ETRPS	(*(unsigned char volatile xdata *)0xfeb0)	/* PWMA的ETR选择寄存器  */
#define	PWMA_ENO	(*(unsigned char volatile xdata *)0xfeb1)	/* PWMA输出使能寄存器   */
#define	PWMA_PS		(*(unsigned char volatile xdata *)0xfeb2)	/* PWMA输出脚选择寄存器 */
#define	PWMA_IOAUX	(*(unsigned char volatile xdata *)0xfeb3)	/* PWMA辅助寄存器       */
#define	PWMB_ETRPS	(*(unsigned char volatile xdata *)0xfeb4)	/* PWMB的ETR选择寄存器  */
#define	PWMB_ENO	(*(unsigned char volatile xdata *)0xfeb5)	/* PWMB输出使能寄存器   */
#define	PWMB_PS		(*(unsigned char volatile xdata *)0xfeb6)	/* PWMB输出脚选择寄存器 */
#define	PWMB_IOAUX	(*(unsigned char volatile xdata *)0xfeb7)	/* PWMB辅助寄存器       */

#define	PWMA_CR1	(*(unsigned char volatile xdata *)0xfec0)	/* PWMA控制寄存器1  */
#define	PWMA_CR2	(*(unsigned char volatile xdata *)0xfec1)	/* PWMA控制寄存器2  */
#define	PWMA_SMCR	(*(unsigned char volatile xdata *)0xfec2)	/* PWMA从模式控制寄存器  */
#define	PWMA_ETR	(*(unsigned char volatile xdata *)0xfec3)	/* PWMA外部触发寄存器  */
#define	PWMA_IER	(*(unsigned char volatile xdata *)0xfec4)	/* PWMA中断使能寄存器  */
#define	PWMA_SR1	(*(unsigned char volatile xdata *)0xfec5)	/* PWMA状态寄存器1  */
#define	PWMA_SR2	(*(unsigned char volatile xdata *)0xfec6)	/* PWMA状态寄存器2  */
#define	PWMA_EGR	(*(unsigned char volatile xdata *)0xfec7)	/* PWMA时件发生寄存器  */

#define	PWMA_CCMR1	(*(unsigned char volatile xdata *)0xfec8)	/* PWMA捕获/比较模式寄存器1  */
#define	PWMA_CCMR2	(*(unsigned char volatile xdata *)0xfec9)	/* PWMA捕获/比较模式寄存器2  */
#define	PWMA_CCMR3	(*(unsigned char volatile xdata *)0xfeca)	/* PWMA捕获/比较模式寄存器3  */
#define	PWMA_CCMR4	(*(unsigned char volatile xdata *)0xfecb)	/* PWMA捕获/比较模式寄存器4  */
#define	PWMA_CCER1	(*(unsigned char volatile xdata *)0xfecc)	/* PWMA捕获比较使能寄存器1  */
#define	PWMA_CCER2	(*(unsigned char volatile xdata *)0xfecd)	/* PWMA捕获比较使能寄存器2  */
#define	PWMA_CNTRH	(*(unsigned char volatile xdata *)0xfece)	/* PWMA计数器高字节   */
#define	PWMA_CNTRL	(*(unsigned char volatile xdata *)0xfecf)	/* PWMA计数器低字节   */

#define PWMA_PSCRH  (*(unsigned char volatile xdata *)0xfed0)	/* PWMA预分频器高字节 */
#define PWMA_PSCRL  (*(unsigned char volatile xdata *)0xfed1)	/* PWMA预分频器低字节 */
#define PWMA_ARRH   (*(unsigned char volatile xdata *)0xfed2)	/* PWMA自动重装寄存器高字节 */
#define PWMA_ARRL   (*(unsigned char volatile xdata *)0xfed3)	/* PWMA自动重装寄存器低字节 */
#define PWMA_RCR    (*(unsigned char volatile xdata *)0xfed4)	/* PWMA重复计数寄存器 */
#define PWMA_CCR1H  (*(unsigned char volatile xdata *)0xfed5)	/* PWMA比较捕获寄存器1高字节 */
#define PWMA_CCR1L  (*(unsigned char volatile xdata *)0xfed6)	/* PWMA比较捕获寄存器1低字节 */
#define PWMA_CCR2H  (*(unsigned char volatile xdata *)0xfed7)	/* PWMA比较捕获寄存器2高字节 */
#define PWMA_CCR2L  (*(unsigned char volatile xdata *)0xfed8)	/* PWMA比较捕获寄存器2低字节 */
#define PWMA_CCR3H  (*(unsigned char volatile xdata *)0xfed9)	/* PWMA比较捕获寄存器3高字节 */
#define PWMA_CCR3L  (*(unsigned char volatile xdata *)0xfeda)	/* PWMA比较捕获寄存器3低字节 */
#define PWMA_CCR4H  (*(unsigned char volatile xdata *)0xfedb)	/* PWMA比较捕获寄存器4高字节 */
#define PWMA_CCR4L  (*(unsigned char volatile xdata *)0xfedc)	/* PWMA比较捕获寄存器4低字节 */
#define PWMA_BKR    (*(unsigned char volatile xdata *)0xfedd)	/* PWMA刹车寄存器 */
#define PWMA_DTR    (*(unsigned char volatile xdata *)0xfede)	/* PWMA死区控制寄存器 */
#define PWMA_OISR   (*(unsigned char volatile xdata *)0xfedf)	/* PWMA输出空闲状态寄存器 */

#define	PWMB_CR1	(*(unsigned char volatile xdata *)0xfee0)	/* PWMB控制寄存器1  */
#define	PWMB_CR2	(*(unsigned char volatile xdata *)0xfee1)	/* PWMB控制寄存器2  */
#define	PWMB_SMCR	(*(unsigned char volatile xdata *)0xfee2)	/* PWMB从模式控制寄存器  */
#define	PWMB_ETR	(*(unsigned char volatile xdata *)0xfee3)	/* PWMB外部触发寄存器  */
#define	PWMB_IER	(*(unsigned char volatile xdata *)0xfee4)	/* PWMB中断使能寄存器  */
#define	PWMB_SR1	(*(unsigned char volatile xdata *)0xfee5)	/* PWMB状态寄存器1  */
#define	PWMB_SR2	(*(unsigned char volatile xdata *)0xfee6)	/* PWMB状态寄存器2  */
#define	PWMB_EGR	(*(unsigned char volatile xdata *)0xfee7)	/* PWMB时间发生寄存器  */

